<?php
$word = file_get_contents(dirname(__FILE__).'/word');

//$word = '操你| 交媾|CAO| K粉|J8| 小姐兼职|交媾|西藏314事件|新疆7\.5事件| 乱伦|毛片|黄片|交配|群交|小姐兼职|茉莉花革命|操你八辈祖宗|操你妈|操你妈屄|操他|曹刚川|草的你妈|草妈|草你妈|草拟妈|肏|测绘局|插GM|插Gm|插gM|插gm|插妳|插你|插你妈|插深些|产权局|朝鲜|车臣|车仑|陈功|陈良宇|陈水扁|陈希同|陈晓宁|陈毅|陈至立|成人电影|成人片|吃大便|吃屎|迟浩田|赤匪|抽插|抽你丫的|臭化西|出售假币|出售枪支|出售手枪|吹喇叭|吹箫|春药|蠢猪|戳你|粗制吗啡|催情药|达赖|达赖喇嘛|打炮||大B|大逼|大便|大波波|大麻|大麻树脂|大麻油|大师|戴维教|大学骚乱|大血B|大血比|呆卵|戴海静|戴红|戴晶|戴维教|党主席|荡妇|档案局|盗窃犯|盗窃犯|道教|邓小平|帝国主义|电监会|叼你|叼你妈|屌|屌7|屌鸠|屌毛|屌妳|屌七|屌西|钓鱼台|丁关根|丁子霖|东北独立|东升|东条英机|东突|东突暴动和独立|东突组织|东亚病夫|董建华|董贱华|董文华|懂文华|独立|独立台湾会|恩格斯|二B|二屄|二逼|二乙基酰胺发抡|发抡功|发伦|发伦功|发轮|发论|发论公|发论功|发骚|法\(轮\)功|法\*轮\*功|法功|法愣|法仑|法轮|法轮大法|法轮功|法西斯|法制办|反动|反革命|发票|冰粉|性奴|反共|反华|反恐委员会|反日|反政府|分裂祖国|佛教|佛展千手法|佛祖|斧头镰刀|阝月|傅鹏|傅作义|干GM|干Gm|干gM|干gm|干拎娘|干妳|干妳老母|干妳妈|干妳娘|干你|干你妈|干你妈b|干你妈逼|干你娘|干七八|干死你|肛|肛交|肛门|港澳办|高俊|高丽棒子|高校暴乱|高校群体事件|高校骚乱|睾|睾丸|膏药旗|弓虽女干|公安|公安部|公安局|共产党|共产主义|共匪|共狗|狗b|狗操|狗卵|狗娘|狗屁|狗日|狗日的|狗屎|观世音|官逼民反|官商勾结|龟儿子|龟公|龟孙子|龟头|鬼村|滚|郭伯雄|国安局|国防部|国防科工委|国管局|国际法院|国家民委|国家主席|国家主要部委|国民党|国民党万岁|海洛因|海洋局|何候华|贺国强|贺龙|黑社会|黑手党|黑手党|黑手党|红卫兵|洪兴|洪志|后庭|胡XX|胡紧涛|胡紧掏|胡紧套|胡锦涛|胡锦淘|胡乔木|胡耀邦|胡主席|花柳|华国锋|华建敏|换妻|黄　菊|黄菊|黄色电影|黄色小电影|回教|回良玉|回民暴动|回族人吃猪肉|昏药|火棒|机八|机巴|鸡八|鸡巴|鸡叭|鸡芭|鸡掰|鸡奸|基地组织|基督|基督教|激情电影|激情小电影|鸡|计牌软件|计生委|妓|妓女|妓院|贾庆林|奸|奸夫淫妇|奸你|奸淫|贱|贱逼|贱货|贱人|江Core|江八|江八点|江独裁|江核心|江青|江戏子|江择民|江泽民|江贼民|江折民|江猪|江猪媳|江主席|僵贼民|疆独|蒋介石|蒋经国|蒋中正|酱猪媳|交通部|姣西|叫床|叫鸡|叫小姐|教育部|她妈的金日成|金正日|禁书|经济社会理事会|经社理事会|精液|精子|警匪一家|敬国神社|靖国神社|静坐|纠察员|鸠|鸠屎|军长发威|军国主义|军妓|尻|靠|靠你妈|靠腰|可待因|可卡叶|可卡因|克林顿|恐怖份子|恐怖主义|口交|寇晓伟|狂操|狂操你全家|拉登|拉姆斯菲尔德|懒教|烂B|烂屄|烂逼|烂比|烂屌|烂货|劳\+教\+所|劳动保障部|老逼|老毛子|老母|黎阳评|李长春|李登辉|李弘旨|李红志|李宏旨|李宏志|李洪志|李岚清|李鹏|李鹏\*|李瑞环|李山|李铁映|李先念|连战|联大|联合国|联合国大会|联易|联易互动|粮食局|两腿之间|列宁|林彪|林业局|刘　淇|刘军|刘淇|刘少奇|刘云山|流氓|六\.四|六。四|六\?四|六合彩|六四|六-四|六四事件|六四真相|龙新民|吕秀莲|旅游局|卵|轮功|轮奸|罗　干|罗干|骡干|妈逼|妈比|妈卖妈屁|妈批|妈祖|妈B|妈的|麻醉钢枪|麻醉枪|麻醉药|麻醉乙醚|马克思|马卖马屁|马英九|吗啡|吗啡碱|吗啡片|买财富|买卖枪支|麦角酸|卖\.国|卖B|卖ID|卖QQ|卖逼|卖比|卖财富|卖党求荣|卖国|卖国求荣|卖号|卖卡|卖软件|卖淫|毛XX|毛厕洞|毛一鲜|毛泽东|毛贼东|毛主席|梅花网|美国|美国佬|美国之音|美利坚|蒙尘药|蒙独|蒙古达子|蒙古独立|迷魂药|迷奸药|迷歼药|迷药|密洞|密宗|民航局|民进党|民运|民政部|明慧网|摩门教|莫索里尼|穆罕默德|穆斯林|乳头|奶子|妳老母的|妳妈的|妳马的|妳娘的|南联盟|南蛮子|南蛮子|B|嫩b|伱妈|你爸|你大爷|你二大爷|你老母|你老味|你姥|你姥姥的|你妈|你妈逼|你妈的|你娘|你爷爷的|鸟GM|鸟Gm|鸟gM|鸟gm|鸟你|牛逼|牛比|农业部|虐待|拍肩神药|喷你|彭真|皮条|屁眼|嫖客|苹果日报|破坏|破鞋|仆街|普京|气象局|钱其琛|枪决女犯|枪决现场|枪支弹药|强奸|强奸犯|强卫|强效失意药|强硬发言|抢劫|乔石|侨办|切七|窃听器|窃听器材|亲民党|青天白日|情色|去你妈的|去死|全国人大';
//$word = '南蛮子|嫩B|嫩b';
//$word = unicode_encode($word);
//echo $word;exit;
if (_preg_match($word, '嫩B')){
    echo 1;
} else {
    echo 2;
}




function _preg_match($filter, $content)
{
    $filter = str_replace(array(
        ']',
        '/',
        '*',
        '(',
        ')',
        '+',
        '?',
        '{',
        '}',
        '.',
        '^',
        '$'
    ), array(
        '\]',
        '\/',
        '\*',
        '\(',
        '\)',
        '\+',
        '\?',
        '\{',
        '\}',
        '\.',
        '\^',
        '\$'
    ), $filter);
    $len = strlen($filter);
    $i = 1;
    $arr = array();
    $start = 0;
    $offset = 0;
    while ($offset < $len) {
        $offset = 1000 * $i;
        if ($offset > $len) {
            $str_tmp = substr($filter, $start, ($len - $start));
            $arr[] = $str_tmp;
            break;
        } else {
            $pos = strpos($filter, '|', $offset);
            $str_tmp = substr($filter, $start, ($pos - $start));
            $arr[] = $str_tmp;
            
            $start = $pos + 1;
            $i ++;
        }
    }
    //print_r($arr);exit;
    
    echo '<br>';
    $status = false;
    foreach ($arr as $k => $v) {
        preg_match('/' . $v . '/', $content, $matches);
        if (! empty($matches) && ! empty($matches[0])) {
            $status = true;
            break;
        }
    }
    return $status;
}


function unicode_encode($name)  
{  
    $name = iconv('UTF-8', 'UCS-2', $name);  
    $len = strlen($name);  
    $str = '';  
    for ($i = 0; $i < $len - 1; $i = $i + 2)  
    {  
        $c = $name[$i];  
        $c2 = $name[$i + 1];  
        if (ord($c) > 0)  
        {    // 两个字节的文字  
            $str .= '\x{'.base_convert(ord($c), 10, 16).base_convert(ord($c2), 10, 16).'}';  
        }  
        else  
        {  
            $str .= $c2;  
        }  
    }  
    return $str;  
}  